# Pivot de tabelas

In [1]:
import pandas as pd
import numpy as np

In [2]:
dias = pd.date_range(start='20190101', periods=12)
dias

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07', '2019-01-08',
               '2019-01-09', '2019-01-10', '2019-01-11', '2019-01-12'],
              dtype='datetime64[ns]', freq='D')

In [3]:
pessoa = ['Jão', 'Zé', 'Tião']

In [4]:
np.random.choice(pessoa)

'Jão'

In [8]:
Nome = []
Gasto = []

for i in range(12):
    Nome.append(np.random.choice(pessoa))
    Gasto.append(np.round( np.random.rand()*100,2) )

In [9]:
Nome

['Zé',
 'Zé',
 'Tião',
 'Zé',
 'Tião',
 'Jão',
 'Tião',
 'Tião',
 'Zé',
 'Tião',
 'Jão',
 'Tião']

In [10]:
Gasto

[74.89,
 12.78,
 37.07,
 71.32,
 82.04,
 77.62,
 50.77,
 96.62,
 58.0,
 43.03,
 1.79,
 85.44]

### Gerando o Dataframe usando as duas listas

In [11]:
df = pd.DataFrame({'Dia':dias, 'Nome': Nome, 'Gasto':Gasto})

In [12]:
df

          Dia  Nome  Gasto
0  2019-01-01    Zé  74.89
1  2019-01-02    Zé  12.78
2  2019-01-03  Tião  37.07
3  2019-01-04    Zé  71.32
4  2019-01-05  Tião  82.04
5  2019-01-06   Jão  77.62
6  2019-01-07  Tião  50.77
7  2019-01-08  Tião  96.62
8  2019-01-09    Zé  58.00
9  2019-01-10  Tião  43.03
10 2019-01-11   Jão   1.79
11 2019-01-12  Tião  85.44

In [14]:
df.pivot(index='Dia', columns='Nome', values='Gasto')

Nome          Jão   Tião     Zé
Dia
2019-01-01    NaN    NaN  74.89
2019-01-02    NaN    NaN  12.78
2019-01-03    NaN  37.07    NaN
2019-01-04    NaN    NaN  71.32
2019-01-05    NaN  82.04    NaN
2019-01-06  77.62    NaN    NaN
2019-01-07    NaN  50.77    NaN
2019-01-08    NaN  96.62    NaN
2019-01-09    NaN    NaN  58.00
2019-01-10    NaN  43.03    NaN
2019-01-11   1.79    NaN    NaN
2019-01-12    NaN  85.44    NaN